fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолеВводаДатаНачалаДействияДоговора = Элементы.Добавить ("ДатаНачалаДействияДоговора",Тип("ПолеФормы")); 
	ПолеВводаДатаНачалаДействияДоговора.Вид = ВидПоляФормы.ПолеВвода; 
	ПолеВводаДатаНачалаДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
	
	ПолеВводаДатаОкончанияДействияДоговора = Элементы.Добавить("ДатаОкончанияДействияДоговора",Тип("ПолеФормы"), ); 
	ПолеВводаДатаОкончанияДействияДоговора.Вид = ВидПоляФормы.ПолеВвода; 
	ПолеВводаДатаОкончанияДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
	
	ПолеВводаСуммаАбонентскойПлаты = Элементы.Добавить("СуммаАбонентскойПлаты",Тип("ПолеФормы"),); 
	ПолеВводаСуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода; 
	ПолеВводаСуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	
	ПолеВводаСтоимостьЧасаРаботы = Элементы.Добавить("СтоимостьЧасаРаботы",Тип("ПолеФормы"),); 
	ПолеВводаСтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода; 
	ПолеВводаСтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	
	ВидимостьРеквизитов();

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидимостьРеквизитов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВидимостьРеквизитов();
	
КонецПроцедуры

#КонецОбласти

	
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВидимостьРеквизитов()
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Элементы.ДатаНачалаДействияДоговора.Видимость = Истина;
		Элементы.ДатаОкончанияДействияДоговора.Видимость = Истина;
	    Элементы.СуммаАбонентскойПлаты.Видимость = Истина;
	    Элементы.СтоимостьЧасаРаботы.Видимость = Истина;
	Иначе
		Элементы.ДатаНачалаДействияДоговора.Видимость = Ложь;
		Элементы.ДатаОкончанияДействияДоговора.Видимость = Ложь;
	    Элементы.СуммаАбонентскойПлаты.Видимость = Ложь;
	    Элементы.СтоимостьЧасаРаботы.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
